www/app/views/jobs/_form.html.erb

SELECT `categories`.* FROM `categories`
---
  <div class="actions">
    <%= f.association :category,
                      collection: Category.all,
                      priority: @job.category,
                      label: "Job Category",
                      prompt: "Choose a job cateogry" %>