www/app/views/jobs/index.html.erb

SELECT `categories`.* FROM `categories`
---
    <ul>
      <% Category.all.each do |category| %>

SELECT `industries`.* FROM `industries`
---
    <ul>
      <% Industry.all.each do |industry| %>

SELECT  `industries`.* FROM `industries` WHERE `industries`.`name` = 'Telecommunications Services' LIMIT 1
---
    <%#= f.select(:with_industry_id, @filterrific.select_options[:with_industry_id], { include_blank: '- Any -' }) %>
    <%= f.collection_check_boxes(:with_industry_id, Industry.all, :id, :name) %>

SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Marketing"]]
---
    <%#= f.select(:with_category_id, @filterrific.select_options[:with_category_id], { include_blank: '- Any -' }) %>
    <%= f.collection_check_boxes(:with_category_id, Category.all, :id, :name) %>