www/app/controllers/jobs_controller.rb

  def index
    if params[:is_from_root]
      location_id_array = Array.new
      location_id_array.push(params[:filterrific][:with_location_id], "")
      params[:filterrific][:with_location_id] = location_id_array
    end

    @filterrific = initialize_filterrific(
      Job.unexpired.published,
      params[:filterrific],
      select_options: {
        sorted_by: Job.options_for_sorted_by,
        with_industry_id: Industry.options_for_select,
        with_category_id: Category.options_for_select,
        with_contract_type_id: ContractType.options_for_select,
        with_location_id: Location.options_for_select,
        with_salary_range_id: SalaryRange.options_for_select,
        with_company_id: Company.options_for_select
      },
      default_filter_params: {},
    ) or return
    @jobs = @filterrific.find.includes(:impressions, :company, :industry, :location, :category, :contract_type).page(params[:page])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = NULL LIMIT 1
SELECT  `industries`.* FROM `industries` WHERE `industries`.`id` = NULL LIMIT 1