www/app/controllers/jobs_controller.rb

SELECT `categories`.* FROM `categories`
SELECT `industries`.* FROM `industries`
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Marketing"]]
SELECT  `industries`.* FROM `industries` WHERE `industries`.`name` = 'Telecommunications Services' LIMIT 1
---
  def index

    if params[:category].blank? && params[:industry].blank?
      @jobs = Job.all.published.order("created_at DESC")
    else
      @category = Category.find_by(name: params[:category])
      @industry = Industry.find_by(name: params[:industry])